{  
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",  
  "contentVersion": "1.0.0.0",  
  "parameters": {  
    "workspaceName": {  
      "defaultValue": "GoogleLab-Workspace",
      "type": "string",  
      "metadata": { "description": "The name of the Sentinel Workspace" }  
    },  
    "huntingQueryName": {  
      "type": "string",  
      "defaultValue": "SampleHuntingQuery",  
      "metadata": { "description": "The unique name of the hunting query artifact" }  
    },  
    "displayName": {  
      "type": "string",  
      "defaultValue": "Suspicious External IPs",  
      "metadata": { "description": "Display name for the hunting query" }  
    },  
    "query": {  
      "type": "string",  
      "defaultValue": "SecurityEvent | where EventID == 4625",  
      "metadata": { "description": "KQL Search Query for hunting" }  
    },  
    "description": {  
      "type": "string",  
      "defaultValue": "Looks for failed logons in SecurityEvent",  
      "metadata": { "description": "Description of the hunting query" }  
    }  
  },  
  "resources": [  
    {  
      "type": "Microsoft.OperationalInsights/workspaces/providers/huntingQueries",  
      "apiVersion": "2022-12-01-preview",  
      "name": "[concat(parameters('workspaceName'), '/Microsoft.SecurityInsights/', parameters('huntingQueryName'))]",  
      "properties": {  
        "displayName": "[parameters('displayName')]",  
        "query": "[parameters('query')]",  
        "description": "[parameters('description')]",  
        "requiredDataConnectors": [],  
        "queryFrequency": null,  
        "queryPeriod": null,  
        "severity": "Medium",  
        "entityMappings": [],  
        "kind": "Hunting"  
      }  
    }  
  ]  
}  
